cfg/Documents/СписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.Основной</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/AccumulationRegisters/ВзаиморасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/Documents/СписаниеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сотрудник.Видимость = Ложь;
	Элементы.Контрагент.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьПоРодителюСтатьи()
	
	Если ЗначениеЗаполнено(Объект.СтатьяДДС) 
		И Объект.СтатьяДДС.Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка() Тогда
		
		Если Объект.СтатьяДДС.Родитель.Наименование = "ДвижениеПоКонтрагенту" Тогда
			Элементы.Контрагент.Видимость = Истина;
		Иначе
			Элементы.Сотрудник.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуДокумента()
	
	Если Объект.СтатьяДДС.Наименование = "Оплата поставщикам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
		               |	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки КАК ВзаиморасчетыСПоставщикамиОстатки
		               |ГДЕ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Контрагент = &Контрагент
		               |	И ВзаиморасчетыСПоставщикамиОстатки.Организация = &Организация
		               |	И ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток >= 0";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаДокумента = Выборка.СуммаОстаток;
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Сотрудник.Видимость = Ложь;
	
	ОпределитьВидимостьПоРодителюСтатьи();
	
	Сумма = ПолучитьСуммуДокумента();

КонецПроцедуры

&НаСервере
Функция СтатьяДДСОбработкаВыбораНаСервере()
	
	Если Объект.СтатьяДДС.Наименование = "Оплата поставщикам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки КАК ВзаиморасчетыСПоставщикамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент = &Контрагент
		|	И ВзаиморасчетыСПоставщикамиОстатки.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаДокументаСписаниеДС = Выборка.СуммаОстаток;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаДокументаСписаниеДС;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СуммаДокумента = СтатьяДДСОбработкаВыбораНаСервере();
КонецПроцедуры
